{"config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 64, 64, 3], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "activation": "relu", "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "units": 128, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "units": 3, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null}}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}